# 팬더스, 데이터프레임, 시리즈

In [10]:
# !conda list | grep pandas # 리눅스용
import pandas as pd

# Series : 데이터프레임의 열
# Series는 파이썬 리스트로 만든다.
s1 = pd.core.series.Series([1, 2, 3])
s2 = pd.core.series.Series(['one', 'two', 'three'])

pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three

# 파일에서 데이터 불러오기

In [20]:
# csv 불러오기
df = pd.read_csv('pandas-master/data/friend_list.csv')
df
df.head(3)
df.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [21]:
# txt 불러오기
df = pd.read_csv('pandas-master/data/friend_list.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [24]:
# tab 구분자
df = pd.read_csv('pandas-master/data/friend_list_tab.txt', delimiter = '\t')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [26]:
# series 이름(컬럼 이름)이 없는 데이터파일 불러오기
df = pd.read_csv('pandas-master/data/friend_list_no_head.csv', header=None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [27]:
# 컬럼 이름 추가하기
df.columns = ['name', 'age', 'job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [29]:
# 컬럼 이름 없는 파일 불러오고, 컬럼 이름 추가 한 번에 하기
df = pd.read_csv('pandas-master/data/friend_list_no_head.csv', header=None, 
                 names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# 데이터프레임 생성하기

In [32]:
# 딕셔너리로 데이터프레임 만들기
# 딕셔너리는 key의 순서가 보장되지 않는다.
friend_dict_list = [
    {'name':'John', 'age':25, 'job':'student'},
    {'name':'Nate', 'age':30, 'job':'teacher'}
]
df = pd.DataFrame(friend_dict_list)
df

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [33]:
# 다음과 같이 컬럼 순서를 변경할 수 있다.
df = df[['name', 'age', 'job']]
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [35]:
# collection으로 순서있는 컬럼의 데이터프레임 만들기
from collections import OrderedDict

friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)
df = pd.DataFrame.from_dict(friend_ordered_dict)
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [36]:
# list를 이용한 데이터프레임 만들기
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]
column_name = ['name', 'age', 'job']
df = pd.DataFrame.from_records(friend_list, columns = column_name)
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [37]:
# list를 이용한 header 한꺼번에 넣는 데이터프레임 만들기
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [20, 30]],
    ['job', ['student', 'teacher']]
]
df = pd.DataFrame.from_items(friend_list)
df

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  import sys

   name  age      job
0  John   20  student
1  Nate   30  teacher

# 데이터프레임 파일로 저장하기

In [41]:
friends = [
    {'name':'Jone', 'age':20, 'job':'student'},
    {'name':'Jenny', 'age':30, 'job':None},
    {'name':'Nate', 'age':30, 'job':'teacher'}
]
df = pd.DataFrame(friends)
df = df[['name', 'age', 'job']]
df

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [42]:
# csv로 저장하기
df.to_csv('friends.csv') # index=True, header=True가 default로 설정되어있음

# index=False로 설정하면, index가 사라지고 저장
# header=False로 설정하면, 컬럼 헤더가 사라지고 저장

In [43]:
# na_rep 매개변수를 주면 None값이 대체됨
df.to_csv('friends.csv')

# 데이터프레임 행, 열 선택 및 필터

In [51]:
friend_list = [
    ['name', ['John', 'Jenny', 'Nate']],
    ['age', [20, 30, 30]],
    ['job', ['student', 'developer','teacher']]
]

df = pd.DataFrame.from_items(friend_list)
df

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  import sys

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [52]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [54]:
# 불연속적인 선택

df.loc[ [0, 2] ] # location

   name  age      job
0  John   20  student
2  Nate   30  teacher

## by column condition

In [56]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [57]:
df.query('age > 25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [58]:
df[ (df.age > 25) & (df.name == 'Nate') ]

   name  age      job
2  Nate   30  teacher

## Filter Column

### by index

In [63]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [65]:
df.iloc[:, 0:2] # index location인 듯

       0   1
0   John  20
1  Jenny  30
2   Nate  30

### by column name

In [67]:
df = pd.read_csv('pandas-master/data/friend_list_no_head.csv', header=None, 
                 names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [69]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [71]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [72]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [73]:
# 정규표현식으로 필터링
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

# 데이터프레임 행, 열 삭제

In [93]:
# 텍스트 인덱스
friends = [
    {'age': 15, 'job': 'student'},
    {'age': 25, 'job': 'developer'},
    {'age': 30, 'job': 'teacher'}
]
df = pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'],
                  columns=['age', 'job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [82]:
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [90]:
# 데이터프레임에 삭제한 것 반영하기
# inplace=True를 주면 df = df.drop(['John', 'Nate'])와 동일
df.drop(['John', 'Nate'], inplace=True)
df

       age        job
Jenny   25  developer

In [115]:
# 숫자 인덱스
friends = [
    {'name': 'John', 'age': 15, 'job': 'student'},
    {'name': 'Ben', 'age': 25, 'job': 'developer'},
    {'name': 'Jenny', 'age': 30, 'job': 'teacher'}
]
df = pd.DataFrame(friends, columns=['name', 'age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [110]:
df.drop(df.index[[0, 2]])

  name  age        job
1  Ben   25  developer

In [111]:
df[df.age > 20]

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [112]:
df.drop('age', axis=1)

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [116]:
df.drop('age', axis=1, inplace=True)
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

# 행, 열 수정 및 수정

In [117]:
friend_dict_list = [
    {'name': 'Jone', 'age': 15, 'job': 'student'},
    {'name': 'Jenny', 'age': 30, 'job': 'developer'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [119]:
df['salary'] = 0
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [120]:
import numpy as np

df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [121]:
friend_dict_list = [
    {'name': 'Jone', 'midterm': 95, 'final': 85},
    {'name': 'Jenny', 'midterm': 85, 'final': 80},
    {'name': 'Nate', 'midterm': 30, 'final': 10}
]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [122]:
df['total'] = df['midterm'] + df['final']
df

    name  midterm  final  total
0   Jone       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [123]:
df['average'] = df['total'] / 2
df

    name  midterm  final  total  average
0   Jone       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [124]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')

df['grade'] = grades
df

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [125]:
def pass_or_fail(row):
    if row != 'F':
        return "Pass"
    else:
        return "Fail"
    
# apply()로 함수를 적용시키기
df.grade = df.grade.apply(pass_or_fail)
df

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [126]:
date_list = [
    {
        'yyyy-mm-dd': '2000-06-27'
    },
    {
        'yyyy-mm-dd': '2007-10-27'
    }
]

df = pd.DataFrame(date_list, columns=['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [127]:
def extract_year(row):
    return row.split('-')[0]

df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [128]:
friend_dict_list = [
    {'name': 'Jone', 'midterm': 95, 'final': 85},
    {'name': 'Jenny', 'midterm': 85, 'final': 80},
    {'name': 'Nate', 'midterm': 30, 'final': 10}
]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [129]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns=['name', 'midterm', 'final'])
df2

  name  midterm  final
0  Ben       50     50

In [131]:
df.append(df2, ignore_index=True) # ignore_index=True는 가지고 있는 인덱스 무시

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50

# 데이터 그룹 생성

In [139]:
student_list = [
    {'name': 'John', 'major': "Computer Science", 'sex':'male'},
    {'name': 'Nate', 'major': "Computer Science", 'sex':'male'},
    {'name': 'Abraham', 'major': "Physics", 'sex':'male'},
    {'name': 'Brian', 'major': "Psychology", 'sex':'male'},
    {'name': 'Janny', 'major': "Economics", 'sex':'female'},
    {'name': 'Yuna', 'major': "Economics", 'sex':'female'},
    {'name': 'Jeniffer', 'major': "Computer Science", 'sex':'female'},
    {'name': 'Edward', 'major': "Computer Science", 'sex':'male'},
    {'name': 'Zara', 'major': "Psychology", 'sex':'female'},
    {'name': 'Wendy', 'major': "Economics", 'sex':'female'},
    {'name': 'Sera', 'major': "Psychology", 'sex':'female'}
]
df = pd.DataFrame(student_list, columns=['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [141]:
groupby_major = df.groupby('major')
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [143]:
for name, group in groupby_major:
    print(name + ": " + str(len(group)))
    print(group)
    print()

Computer Science: 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics: 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics: 1
      name    major   sex
2  Abraham  Physics  male

Psychology: 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [145]:
df_major_cnt = pd.DataFrame( {'count': groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [146]:
groupby_sex = df.groupby('sex')

for name, group in groupby_sex:
    print(name + ': ' + str(len(group)))
    print(group)
    print()

female: 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male: 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

# 중복 데이터 삭제

In [147]:
student_list = [
    {'name': 'John', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Nate', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Edward', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Zara', 'major': 'Psychology', 'sex': 'female'},
    {'name': 'John', 'major': 'Computer Science', 'sex': 'male'},
]
df = pd.DataFrame(student_list, columns=['name', 'major', 'sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

In [148]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [149]:
df.drop_duplicates()

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

In [150]:
student_list = [
    {'name': 'John', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Nate', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Edward', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Zara', 'major': 'Psychology', 'sex': 'female'},
    {'name': 'Wendy', 'major': 'Economics', 'sex': 'female'},
    {'name': 'Nate', 'major': None, 'sex': 'male'},
    {'name': 'John', 'major': 'Economics', 'sex': 'male'},
]
df = pd.DataFrame(student_list, columns=['name', 'major', 'sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

In [152]:
df.duplicated(['name'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [154]:
df.drop_duplicates(['name'], keep='first') # default

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female

In [155]:
df.drop_duplicates(['name'], keep='last')

     name             major     sex
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male